# Install with `brew bundle`

# --- Taps ---
# Homebrew 3.0.0+ do not need these
# tap "homebrew/cask"
# tap "homebrew/core"

# --- CLI Tools ---
brew "git"                      # Version control system
brew "vim"                      # Editor
brew "tmux"                     # Tmux
brew "fzf"                      # Fuzzy Finder
brew "ripgrep"                  # Search tool
brew "jq"                       # JSON processor
brew "bottom"                   # Monitor
brew "bat"                      # Syntax Highlighting

# --- Shell Tools ---
brew "zsh"                      # Z shell
brew "pure"                     # Pure theme
brew "zsh-completions"          # Additional completions for zsh
brew "zsh-autosuggestions"      # Fish-like autosuggestions
brew "zsh-autocomplete"         # Real-time type-ahead completion
brew "zsh-syntax-highlighting"  # Syntax highlighting for commands

# --- Development Tools ---
brew "node"                     # NodeJS
brew "nvm"                      # Node version manager
brew "ruby"                     # Ruby
brew "rbenv"                    # Ruby version manager

# --- GUI Applications ---
cask "alfred"                   # Productivity application
cask "iterm2"                   # Terminal emulator
cask "firefox"                  # Web browser
cask "dbeaver-community"        # Database tool

# --- Fonts ---
cask "font-hack-nerd-font"      # Patched font with icons
