# Install with `brew bundle`

# --- Taps ---
# Homebrew 3.0.0+ do not need these
# tap "homebrew/cask"
# tap "homebrew/core"

# --- CLI Tools ---
brew "git"               # Version control system
brew "fzf"               # Fuzzy finder
brew "ripgrep"           # Fast text search tool
brew "findutils"         # GNU find, locate, xargs
brew "jq"                # JSON processor
brew "vim"               # Text editor
brew "tmux"              # Terminal multiplexer
brew "rbenv"             # Ruby version manager

# --- Shell Tools ---
brew "zsh"               # Z shell
brew "zsh-completions"   # Additional completions for zsh

# --- Development Tools ---
brew "node"              # JavaScript runtime

# --- GUI Applications ---
cask "alfred"            # Productivity application
cask "iterm2"            # Terminal emulator
cask "firefox"           # Web browser
cask "dbeaver-community" # Database tool

# --- Fonts ---
cask "font-hack-nerd-font" # Patched font with icons
